// Написать программу, которая на вход принимает 2 числа и выдает какое больше, а какое меньше

int a = 1;
int b = 15;
if (a!=b)
{
    if (a > b)
    {
        System.Console.WriteLine("max = a");
        System.Console.WriteLine("min = b");
    }
    else
    {
        System.Console.WriteLine("max = b");
        System.Console.WriteLine("min = a");
    }
}